---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveProjectTooShort
source: html/28142d0a-1375-4f31-083a-74c37ac58ee4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.CurveProjectTooShort Property

The projection of the line in this view is too short to create a new Line

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveProjectTooShort { get; }
```